{
    "architectures": [
      "TinyLlavaForConditionalGenerationConnectRelaAddSelf"
    ],
    "cache_dir": null,
    "connector_type": "mlp2x_gelu",
    "hidden_size": 1024,
    "ignore_index": -100,
    "image_aspect_ratio": "square",
    "image_token_index": -200,
    "llm_model_name_or_path": "./pretrained_ckpt/Qwen1.5-0.5B",
    "model_type": "tinyllava",
    "num_queries": 512,
    "num_resampler_layers": 3,
    "pad_token": null,
    "resampler_hidden_size": 768,
    "teacher_pretrained_dir": "./teacher_pretrained_ckpt",
    "teacher_pretrained_name": "tiny-llava-Qwen1.5-4B-siglip-so400m-patch14-384-base-",
    "text_config": {
      "_name_or_path": "./pretrained_ckpt/Qwen1.5-0.5B",
      "architectures": [
        "Qwen2ForCausalLM"
      ],
      "bos_token_id": 151643,
      "eos_token_id": 151643,
      "hidden_size": 1024,
      "intermediate_size": 2816,
      "max_position_embeddings": 32768,
      "max_window_layers": 21,
      "model_type": "qwen2",
      "num_attention_heads": 16,  
      "num_hidden_layers": 24,
      "num_key_value_heads": 16,
      "rope_theta": 1000000.0,
      "sliding_window": 32768,
      "tie_word_embeddings": true,
      "torch_dtype": "bfloat16",
      "use_sliding_window": false,
      "vocab_size": 151936
    },
    "tokenizer_model_max_length": 2048,
    "tokenizer_name_or_path": "./pretrained_ckpt/Qwen1.5-0.5B",
    "tokenizer_padding_side": "right",
    "tokenizer_use_fast": false,
    "torch_dtype": "float16",
    "transformers_version": "4.39.3",
    "tune_type_connector": "full",
    "tune_type_llm": "full",
    "tune_type_vision_tower": "frozen",
    "tune_vision_tower_from_layer": 0,
    "use_cache": true,
    "vision_config": {
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1152,
      "image_size": 384,
      "intermediate_size": 4304,
      "layer_norm_eps": 1e-06,
      "model_name_or_path": "./pretrained_ckpt/siglip-so400m-patch14-384",
      "model_name_or_path2": "",
      "model_type": "siglip_vision_model",
      "num_attention_heads": 16,
      "num_hidden_layers": 27,
      "patch_size": 14
    },
    "vision_feature_layer": -2,
    "vision_feature_select_strategy": "patch",
    "vision_hidden_size": 1152,
    "vision_model_name_or_path": "./pretrained_ckpt/siglip-so400m-patch14-384",
    "vision_model_name_or_path2": "",
    "vocab_size": 151936
  }